function GrayValue = Interpolate(x,y,X1,Y1,Value00,Value10,Value01,Value11)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%    功  能：输入圆域半径和采样点数目得到圆域采样点坐标模板    %%%
%%%    输  入：Radius：圆域半径；                                                %%%
%%%               Number：圆域采样点数目；                                     %%%
%%%    输  出：Template ：圆域采样点坐标模板。                           %%%
%%%                                                                                             %%%
%%%    作  者：李永超                                                                    %%%
%%%    时  间：2013.1.08                                                                %%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
  f1=(1-(x-X1))*(1-(y-Y1))*Value00;
  f2=(x-X1)*(1-(y-Y1))*Value10;
  f3=(1-(x-X1))*(y-Y1)*Value01;
  f4=(x-X1)*(y-Y1)*Value11;
  GrayValue=f1+f2+f3+f4;
end

